using Task_2;

namespace lab_3
{
    class Program
    {
        static void Main()
        {
            var мережа = new Мережа();
            var сервер = new Сервер("192.168.1.1", 1000, "Windows Server");
            var робочаСтанція = new РобочаСтанція("192.168.1.2", 500, "Windows 10");
            var маршрутизатор = new Маршрутизатор("192.168.1.3", 800, "RouterOS");

            мережа.ДодатиКомпютер(сервер);
            мережа.ДодатиКомпютер(робочаСтанція);
            мережа.ДодатиКомпютер(маршрутизатор);
    
        мережа.ВзаємодіяКомпютерів();
        }
    }
}