namespace ConsoleApp1
{
    public class Мікроорганізм : ЖивийОрганізм, IReproducible
    {
        public bool МожливістьРозмноження { get; set; }

        public Мікроорганізм(int енергія, int вік, int розмір, bool можливістьРозмноження)
            : base(енергія, вік, розмір)
        {
            МожливістьРозмноження = можливістьРозмноження;
        }

        public void Розмножитися()
        {
            if (МожливістьРозмноження)
            {
                // Логіка розмноження мікроорганізмів
            }
        }
    }
}
